read_verilog fin/d_alu.v
hierarchy -top alu
proc; opt; techmap; opt
write_verilog synth.v
show alu
